export const professionInfo = [
	{
		name: '国家公务员及企事业单位负责人',
		code: '000',
		children: [
			{name: '国家公务员', code: '001'},
			{name: '事业单位负责人', code: '002'},
			{name: '企业负责人', code: '003'}
		]
	},
	{
		name: '专业技术人员',
		code: '100',
		children: [
			{name: '科学研究人员', code: '101'},
			{name: '工程技术人员', code: '102'},
			{name: '农业技术人员', code: '103'},
			{name: '飞机和船舶技术人员', code: '104'},
			{name: '卫生专业技术人员', code: '105'},
			{name: '经济业务人员', code: '106'},
			{name: '金融业务人员', code: '107'},
			{name: '法律专业人员', code: '108'},
			{name: '教学人员', code: '109'},
			{name: '文学艺术工作人员', code: '110'},
			{name: '体育工作人员', code: '111'},
			{name: '新闻出版、文化工作人员', code: '112'},
			{name: '宗教职业者', code: '113'},
			{name: '其他专业技术人员', code: '114'}
		]
	},
	{
		name: '公司职员和事业单位员工',
		code: '200',
		children: [
			{name: '行政办公人员', code: '201'},
			{name: '安全保卫和消防人员', code: '202'},
			{name: '邮政和电信业务人员', code: '203'},
			{name: '其他办事人员和有关人员', code: '204'},
			{name: '外国使领馆人员', code: '205'},
			{name: '慈善机构工作人员', code: '206'}
		]
	},
	{
		name: '商业、服务业人员',
		code: '300',
		children: [
			{name: '购销人员', code: '301'},
			{name: '仓储人员', code: '302'},
			{name: '餐饮服务人员', code: '303'},
			{name: '饭店、旅游及健身娱乐场所服务人员', code: '304'},
			{name: '运输服务人员', code: '305'},
			{name: '医疗卫生辅助服务人员', code: '306'},
			{name: '社会服务和居民生活服务人员', code: '307'},
			{name: '其他商业、服务业人员', code: '308'},
			{name: '珠宝、贵金属、艺术品收藏及拍卖人员', code: '309'},
			{name: '废旧物资回收人员', code: '310'}
		]
	},
	{
		name: '农、林、牧、渔、水利业生产人员',
		code: '400',
		children: [
			{name: '农民', code: '401'},
			{name: '林业生产及野生动植物保护人员', code: '402'},
			{name: '畜牧业生产人员', code: '403'},
			{name: '渔业生产人员', code: '404'},
			{name: '水利设施管理养护人员', code: '405'},
			{name: '其他农、林、牧、渔、水利业生产人员', code: '406'}
		]
	},
	{
		name: '工人',
		code: '500',
		children: [
			{name: '勘探及矿物开采人员', code: '501'},
			{name: '金属冶炼、轧制人员', code: '502'},
			{name: '化工产品生产人员', code: '503'},
			{name: '机械制造加工人员', code: '504'},
			{name: '机电产品装配人员', code: '505'},
			{name: '机械设备修理人员', code: '506'},
			{name: '电力设备安装、运行、检修及供电人员', code: '507'},
			{name: '电子元器件与设备制造、装配、调试及维修人员', code: '508'},
			{name: '橡胶和塑料制品生产人员', code: '509'},
			{name: '纺织、针织、印染人员', code: '510'},
			{name: '裁剪、缝纫和皮革、毛皮制品加工制作人员', code: '511'},
			{name: '粮油、食品、饮料生产加工及饲料生产加工人员', code: '512'},
			{name: '烟草及其制品加工人员', code: '513'},
			{name: '药品生产人员', code: '514'},
			{name: '木材加工、人造板生产、木制品制作及制浆、造纸和纸制品生产加工人员', code: '515'},
			{name: '建筑材料生产、加工人员', code: '516'},
			{name: '玻璃、陶瓷、搪瓷及其制品生产加工人员', code: '517'},
			{name: '广播影视制品制作、播放及文物保护作业人员', code: '518'},
			{name: '印刷人员', code: '519'},
			{name: '工艺、美术品制作人员', code: '520'},
			{name: '文化教育、体育用品制作人员', code: '521'},
			{name: '工程施工人员', code: '522'},
			{name: '运输设备操作人员及有关人员', code: '523'},
			{name: '环境监测与废物处理人员', code: '524'},
			{name: '检验、计量人员', code: '525'},
			{name: '其他生产、运输设备操作人员及有关人员', code: '526'}
		]
	},
	{
		name: '军人/武警',
		code: '600',
		children: []
	},
	{
		name: '私营业主/自由职业',
		code: '700',
		children: [
			{name: '自由职业', code: '702'},
			{name: '私营业主', code: '703'}
		]
	},
	{
		name: '离退休人员',
		code: '995',
		children: []
	},
	{
		name: '家庭妇女',
		code: '996',
		children: []
	},
	{
		name: '学生',
		code: '997',
		children: []
	},
	{
		name: '失业/无业',
		code: '998',
		children: []
	}
];
