import { IS_TEST } from "../app";
/**
 * 银行对象，用于存放 "套餐ID || 权益ID" 
 */
const cictBankObj = {
    citicBankshopProductId: IS_TEST ? '1108398050782486528' : '1109116737144102912',	// 中信银行套餐的金卡套餐ID 分别是测试环境下和正式环境下
    citicBankShopshopProductId: IS_TEST ? '1108397635760300032' : '1109116407530528768',	// 中信银行里的白金套餐的套餐ID 分别是测试环境下和正式环境下
    citicBankRightId: IS_TEST ? '1092482405515665408' : '1117833250457919488',	// 银行签约后独立权益ID
    wellBankShopProductId: IS_TEST ? '1126085154731728896' : '1129091866749968384',	// 平安信用卡套餐ID
    cictBankNmGoldCard: IS_TEST ? '1160975248860913664' : '1151475676992905216',	// 中信银行蒙通卡套餐的金卡套餐ID 分别是测试环境下和正式环境下
    cictBankNmPlatinumCard: IS_TEST ? '1160975461608595456' : '1151526287054610432',	// 中信银行蒙通卡套餐的白金卡套餐ID 分别是测试环境下和正式环境下
    minshenBank: IS_TEST ? '1188851910218620928' : '1199301561518923776',	// 民生银行 分别是测试环境下和正式环境下
    guangfaBank: IS_TEST ? '1212340736891035648' : '1220403044448608256',     // 广发银行 分别是测试环境下和正式环境下
    citicBankshopProductIds: IS_TEST ? ['1108398050782486528','1108397635760300032','1160975248860913664','1160975461608595456','1126085154731728896','1188851910218620928','1212340736891035648'] : 
                                       ['1109116737144102912','1109116407530528768','1151475676992905216','1151526287054610432','1129091866749968384','1199301561518923776','1220403044448608256']	// 套餐ID集合
}

// 模块导出
module.exports = {
    cictBankObj
}